load-test.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 15
      arrivalRate: 10
      rampTo: 50
      name: "Quick Sanity Check"
    - duration: 30
      arrivalRate: 50
      name: "Short Load Test"
scenarios:
  - name: "Basic Load Test"
    flow:
      - get:
          url: "/"
          timeout: 3000
          retry: 2
          expect:
            statusCode: 200