load-test.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      rampTo: 100
      name: "Warm-up phase"
    - duration: 60
      arrivalRate: 200
      name: "Sustained high load"
    - duration: 30
      arrivalRate: 250
      rampTo: 50
      name: "Spike test"
    - duration: 30
      arrivalRate: 300
      name: "Failure Simulation"
      loadBalancing: "roundRobin"
    - duration: 30
      arrivalRate: 200
      rampTo: 0
      name: "Cooldown"

scenarios:
  - name: "Basic Load Test"
    flow:
      - get:
          url: "/"
          timeout: 5000
          retry: 3 
          expect:
            statusCode: 200